"use client";

import { useEffect, useRef } from "react";
import { gsap } from "gsap";
import { ScrollTrigger } from "gsap/ScrollTrigger";
import ArrowRight from "../../../public/icons/ArrowRight";
import Image from "next/image";
import TitlePages from "../../module/TitlePages";

gsap.registerPlugin(ScrollTrigger);

const servicesData = [
    {
        id: 1,
        title: "اسپارک‌تک  -  یه شبکه خفن، سریع و امن!",
        services: [
            "طراحی وبسایت:  با طراحی UI/UX حرفه‌ای، یه وبسایت کاربرپسند و جذاب براتون می‌سازیم که هم خوشگل باشه هم راحت و سریع!",
            "بهینه‌سازی سرعت وبسایت:  با فوت‌وفن‌های جادویی، کاری می‌کنیم که سایت شما مثل یه فرفره بچرخه! دیگه لازم نیست برای لود شدن صفحه‌ها چای دم کنین!",
            "امنیت وب‌سایت و شبکه‌های اجتماعی:  امنیت برای ما خیلی مهمه! ما مثل یه سپر محکم از سایت و شبکه‌های اجتماعی شما در برابر هر گونه حمله و نفوذ محافظت می‌کنیم!",
            "پشتیبانی و نگهداری وبسایت:  ما همیشه هواتون رو داریم! با پشتیبانی فنی ۲۴ ساعته، نمی‌ذاریم سایت‌تون یه لحظه هم تنها بمونه.",
            "بهینه‌سازی موتور‌های جست‌وجو:  می‌خواین سایت شما تو صفحه اول گوگل خودنمایی کنه؟ ما با سئو حرفه‌ای، کاری می‌کنیم که سایت شما توی نتایج جستجو بدرخشه و کلی مشتری جدید جذب کنه!",
        ]
    },
    {
        id: 2,
        title: "اسپارک‌‌استودیو -  خلاقیت در هر پیکسل!",
        services: [
            "تولید محتوای ویدیویی:  یه ویدیوی باحال و خلاقانه می‌تونه مثل یه جرقه کسب‌وکار شما رو روشن کنه! ما با ساخت ویدیوهای دو بعدی، سه بعدی و موشن گرافیک، باعث می‌شیم همه محو تماشای ویدیوهای شما بشن! ",
            "طراحی تبلیغات چاپی:  کی گفته تبلیغات چاپی قدیمی شده؟ ما با طراحی پوستر، بروشور و کاتالوگ‌های خلاقانه و جذاب، کاری می‌کنیم که همه جا حرف شما باشه!",
            "طراحی بسته‌بندی:  بسته‌بندی محصول شما اولین چیزیه که مشتری می‌بینه! ما یه بسته‌بندی شیک و خاص برات طراحی می‌کنیم که مشتری‌ها رو مثل یه آهنربا به سمت محصول شما بکشونه! ",
            "عکاسی و فیلم‌برداری:  ما با عکاسی و فیلم‌برداری حرفه‌ای در زمینه‌های صنعتی، تبلیغاتی، محصولات و مدلینگ، کاری می‌کنیم که همه با دیدن عکس‌ها و فیلم‌ها شما ذوق کنن! " ,
            "انواع بیلبورد و استرابورد:  بیلبوردهای شما باید تو خیابون خودنمایی کنن! ما بیلبورد و استرابوردهای خلاقانه و جذاب طراحی می‌کنیم که نگاه همه رو به خودشون جذب کنن!"
        ]
    },
    {
        id: 3,
        title: "اسپارک ادز  -  مشتری‌ها رو هدف می‌گیریم!",
        services: [
            "تبلیغات دیجیتال:  ما با تبلیغات هدفمند تو گوگل و شبکه‌های اجتماعی، مشتری‌های شمارو پیدا می‌کنیم و فروش شما رو چند برابر می‌کنیم! ",
            "شبکه‌های اجتماعی:  ما تو شبکه‌های اجتماعی حسابی فعالیم و با محتواهای جذاب و تعامل با فالوورها، جاتون همیشه توی اکسپلوره! ",
            "بازاریابی محتوا:  با محتوای باحال و خوندنی، مشتری‌ها رو جذب می‌کنیم و اون‌ها رو به طور کامل با محصولات و خدمات شما آشنا می‌کنیم! " ,
            "همکاری در فروش:  با همکاری در فروش، دایره مشتریان شما رو گسترش می‌دیم و فروش شما رو چند برابر می‌کنیم. " ,
            "روابط عمومی:  با رسانه‌ها رفیق می‌شیم و خبرهای خوب شما رو به گوش همه می‌رسونیم!"
        ]
    },

    {
        id: 4,
        title: "اسپارک پلن  -  یه برنامه‌ی خفن برای موفقیت!",
        services: [
            "مشاوره بازاریابی:  ما با مشاوره‌های تخصصی، کمک‌تون می‌کنیم تا بهترین تصمیم‌ها رو برای کسب‌وکارتون بگیرین. " ,
            "تحلیل و ارزیابی نتایج:  ما با دقت و حوصله، نتیجه‌های کار رو بررسی می‌کنیم و با تحلیل داده‌ها، بهتون کمک می‌کنیم تا هر روز بهتر از دیروز بشین! " ,
            "رویدادها و نمایشگاه‌ها:  با برگزاری رویدادهای هیجان‌انگیز و شرکت در نمایشگاه‌ها، اسم شما رو سر زبون‌ها می‌اندازیم! " ,
            "برندسازی:  ما یه برند قدرتمند و منحصربه‌فرد براتون می‌سازیم که همه بشناسن‌تون و بهتون اعتماد کنن. " ,
            "معماری کسب‌وکار:  ما به شما کمک می‌کنیم تا ساختار کسب‌وکارتون رو مثل یه ساعت منظم و کارآمد کنین. " ,
            "تحقیقات بازار:  ما بازار رو مثل کف دست می‌شناسیم و بهتون می‌گیم که مشتری‌ها چی می‌خوان. ",
            "طراحی و اجرای کمپین:  ما با طراحی و اجرای کمپین‌های تبلیغاتی خلاقانه و هدفمند، اسم برندتون رو معروف و فروش‌تون رو چند برابر می‌کنیم. "
        ]
    }
];


export default function StackedCards() {
    const containerRef = useRef(null);
    const cardsRef = useRef([]);

    useEffect(() => {
        const sections = cardsRef.current;

        gsap.timeline({
            scrollTrigger: {
                trigger: containerRef.current,
                start: "top top",
                end: "+=900%",
                pin: true,
                scrub: 2,
            },
        })
            .to(sections[1], { opacity: 1, y: 0, x: 0, zIndex: 1 }, "step1+=1")
            .to(sections[0], { opacity: 0 }, "step1+=1")
            .to(sections[2], { opacity: 1, y: 0, x: 0, zIndex: 2 }, "step2+=1")
            .to(sections[1], { opacity: 0 }, "step2+=1");
    }, []);

    return (
        <>
            <TitlePages title="خدمات"/>

            <div ref={containerRef} className="relative w-full flex justify-center mb-[900px]">
                {servicesData.map((card, index) => (
                    <div
                        key={card.id}
                        ref={(el) => (cardsRef.current[index] = el)}
                        className="absolute w-[90%] bg-white border-2 border-[#FF8500] shadow-2xl rounded-tr-[150px] rounded-bl-[150px] p-6 flex flex-col items-start text-right text-xl text-gray-800 transition-all duration-500 mt-10"
                        style={{
                            opacity: index === 0 ? 1 : 0,
                            transform: index === 0 ? "translateY(0px)" : "translateY(50px)",
                            zIndex: index === 0 ? 5 : -index,
                        }}
                    >
                        <p className="text-[18px] font-bold mt-12">{card.title}</p>
                        <ul className="mt-4 text-sm text-gray-600 list-disc list-inside leading-10 text-black">
                            {card.services.map((service, idx) => (
                                <li key={idx}>{service}</li>
                            ))}
                        </ul>
                        <button className="mt-4 text-[#C1121F] font-bold flex items-center gap-1 text-base">
                            <ArrowRight/> مشاهده بیشتر
                        </button>
                    </div>
                ))}
            </div>
        </>
    );
}
