import TextAboutSpark from "../../module/TextAboutSpark";

const Awards = ()=>{

    return(

        <>

            <TextAboutSpark
            title="افتخارات و جوایز"
            description="یه جرقه کافی بود تا اسپارک‌آپ متولد بشه!   اسپارک‌آپ از دل یه ایده‌ی ناب و خفن بیرون اومد تا دنیای تبلیغات رو تکون بده و به کسب‌وکارها کمک کنه تا حسابی بدرخشن.  ما یه تیم جوون و پرانرژی هستیم که عاشق چالش‌های جدیدیم و با کلی ایده‌های خلاقانه، می‌خوایم کسب‌وکارتون رو متحول کنیم.   حالا که با اسپارک‌آپ آشنا شدین، بیاین یه نگاهی به خدمات‌مون بندازیم:"
            />

        </>

    )

}


export default Awards;