import TextAboutSpark from "../../module/TextAboutSpark";

const Story = ()=>{

    return(

        <>

            <div className="mt-10">
                <TextAboutSpark
                    title="داستان ما"
                    description=" ما یه تیم جوون و پرانرژی هستیم که  با جون و دل  کنارتونیم تا  با  کلی  ایده‌های  خلاقانه  و  راهکارهای  درجه  یک،  مسیر  رشدتون  رو  هموار  کنیم  و  کاری  کنیم  که  تو  بازار  حسابی  بدرخشین!  ما  تو  اسپارک‌آپ  مثل  یه  جادوگر،  هزینه‌های اضافی  رو  غیب  می‌کنیم،  واسطه‌ها  رو  حذف  می‌کنیم  و  با  کلی  ایده‌های  خفن  و  راهکارهای  خلاانه،  کاری  می‌کنیم  که  کسب‌وکارتون  مثل  فشفشه  بگیره  و  با  سرعت  نور  به  هدفاتون  برسین!  ما  به  خلاقیت،  تخصص و  انرژی  جوونی  اعتقاد  داریم  و  می‌خوایم  یه  آینده  روشن  و  هیجان‌انگیز  برای  تبلیغات  و  بازاریابی  تو  دنیا  بسازیم!   پس  اگه  دنبال  یه  تیم  خفن  و  پایه  می‌گردین  که  کسب‌وکارتون  رو  متحول  کنه،  اسپارک‌آپ  همیشه  کنارتونه!"
                />
            </div>

        </>

    )

}


export default Story;