import TextAboutSpark from "../../module/TextAboutSpark";

const Story = () => {
  return (
    <>
      <div className="-mt-10">
        <TextAboutSpark
          title="همه‌چی از یه جرقه شروع شد…"
          description="   پاییز ۱۴۰۰، دو تا جوون خلاق تصمیم گرفتن دست به کار بشن. اونا نمی‌خواستن یه آژانس تبلیغاتی معمولی باشن… می‌خواستن یه جریان تازه راه بندازن.
                          اسمش رو گذاشتن اسپارک‌آپ، چون اینجا همه‌چی با یه جرقه شروع می‌شه:
                          جرقه‌ی ایده‌ها
                          جرقه‌ی خلاقیت
                          جرقه‌ی تغییر!
                          تو اسپارک‌آپ، هرجرقه یه رنگ مخصوص به خودش داره!همه اینجا باحال، پرانرژی، پایه و عاشق کارشونن.
                          ما یه خانواده‌ایم که به‌جای رقابت با هم، با هم می‌ترکونیم!"
        />
        <TextAboutSpark
          title="ما فقط یه آژانس نیستیم؛ ما رفیق شماییم!"
          description="ما اینجاییم تا به‌جای نسخه‌های آماده، راهکارهایی مخصوص خودت بسازیم.
                          گوش می‌دیم، همفکری می‌کنیم، می‌خندیم، ایده می‌سازیم و آخرش کاری می‌کنیم که کسب‌وکارت بدرخشه.
                          توی این مسیر، ما رفیق شفیق شماییم 
                          نه فقط برای یه پروژه،
                          بلکه برای یه مسیر رشد واقعی و پایدار."
        />
      </div>
    </>
  );
};

export default Story;
