import React from "react";
import TextServiceSpark from "../../module/TextServiceSpark";

const OnlineAdvertising = ()=>{

    return(

        <>

            <TextServiceSpark
            title="تبلیغات آنلاین"
            description="تولید محتوای ویدیویی:  یه ویدیوی باحال و خلاقانه می‌تونه مثل یه جرقه کسب‌وکار شما رو روشن کنه! ما با ساخت ویدیوهای دو بعدی، سه بعدی و موشن گرافیک، باعث می‌شیم همه محو تماشای ویدیوهای شما بشن!
طراحی تبلیغات چاپی:  کی گفته تبلیغات چاپی قدیمی شده؟ ما با طراحی پوستر، بروشور و کاتالوگ‌های خلاقانه و جذاب، کاری می‌کنیم که همه جا حرف شما باشه!
طراحی بسته‌بندی:  بسته‌بندی محصول شما اولین چیزیه که مشتری می‌بینه! ما یه بسته‌بندی شیک و خاص برات طراحی می‌کنیم که مشتری‌ها رو مثل یه آهنربا به سمت محصول شما بکشونه!
عکاسی و فیلم‌برداری:  ما با عکاسی و فیلم‌برداری حرفه‌ای در زمینه‌های صنعتی، تبلیغاتی، محصولات و مدلینگ، کاری می‌کنیم که همه با دیدن عکس‌ها و فیلم‌ها شما ذوق کنن!
انواع بیلبورد و استرابورد:  بیلبوردهای شما باید تو خیابون خودنمایی کنن! ما بیلبورد و استرابوردهای خلاقانه و جذاب طراحی می‌کنیم که نگاه همه رو به خودشون جذب کنن!"
            />

        </>

    )

}


export default OnlineAdvertising;