export const jobOpenings = [
  {
    id: 1,
    icon: "📝",
    title: "کارشناس محتوا (Content Specialist)",
    description:
      "اگه با کلمات می‌تونی جادو کنی و دلت می‌خواد با نوشتن محتواهای جذاب، مردم رو جذب کنی، اینجا جاییه که باید باشی! از وب‌سایت و وبلاگ گرفته تا کپی رایتینگ تو می‌تونی محتواهای نابی بسازی که هیچ‌کس ازش بی‌خبر نمونه.",
    skills: [
      "عاشق نوشتن و تولید محتوای جذاب و باحال",
      "آشنایی با اصول سئو و کپی رایتینگ",
      "توانایی ترکیب خلاقیت با اهداف برند",
    ],
  },
  {
    id: 2,
    icon: "📱",
    title: "ادمین (Social Media Admin)",
    description:
      "اگه دوست داری پیج‌های اینستاگرام و تلگرام رو مدیریت کنی و پست‌ها و استوری‌هایی بسازی که همه جا وایرال بشه، این موقعیت واسه توئه!",
    skills: [
      "تسلط به همه شبکه‌های اجتماعی مثل اینستاگرام، تلگرام و لینکدین و ...",
      "توانایی تولید محتوای جذاب و متناسب با نیاز هر پیج",
      "آشنایی با تبلیغات در شبکه‌های اجتماعی و اجرای کمپین‌های هوشمند",
    ],
  },
  {
    id: 3,
    icon: "🔍",
    title: "کارشناس سئو (SEO Specialist)",
    description:
      "اگه همیشه دوست داشتی برای سایت‌ها کار کنی که تو گوگل از همه جلوتر باشن، وقتشه به تیم اسپارک‌آپ بیای! اینجا تو می‌تونی با یه کلی تکنیک سئو سایت‌ها رو به سطح جدید برسونی!",
    skills: [
      "تسلط به اصول و تکنیک‌های سئو",
      "توانایی نوشتن استراتژی و تحقیق کلمات کلیدی",
      "آشنایی با ابزارهای تحلیل مثل Google Analytics، Google Search Console",
    ],
  },
];
